Revit 2026 API

# ProjectInfoName Property

---

Get or Set the Project Name of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; set; }
```
```vb
Public Property Name As String
	Get
	Set
```
```cpp
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Name : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Name of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace